// const x1 = 10;
// const x2 = 30;
// const number = 45;

//  console.log(`Число ${number} потравляє у відрізок до ${x1}? `, number < x1 );




// const isOnline = true;
// const isFriend = true;
// const isDnd = true;

// const canOpenChat = isOnline && isFriend && !isDnd; 
//  true && true && false ( із за знаку оклику воно фолс)

// console.log("Можна відкрити чат? ", canOpenChat);

// ! - робить з true - false




// const sub = "free";

// const canAccessContent = sub==="pro" || sub==="vip";

// console.log('Є доступ до контенту? ', canAccessContent);





// const salary = 5000;
// let message;

// if(salary <= 5000){
    // message = "Ваша зп менше 5000!";
// else {
    // message = "Ваша зп більше 5000!";
// console.log(message);

// const message = salary <= 5000 ? 10 : 20;




// const message = "vip" ? 'Ви отримуєте доступ' : 'У вас немає доступу';

// if('vip'){
    // console.log('Ви отримуєте доступ');
// } else {
    // console.log('У вас немає доступу');
// }
// console.log(message);



// const a = 5;
// console.log(5);

// if(true){
//     const b = 10;
//     console.log(b);
//     console.log(a);
// }





/*
 * Напиши скрипт обробки покупки в магазині.
 *
 * - Баланс користувача зберігається в змінній balance
 * - Сумма покупки зберігається в змінній payment
 *
 * - Перед перевіркою вивести повідомлення:
 * «Загальна вартість замовлення [число] кредитів. Перевіряємо кількість 
 * доступних коштів на рахунку»
 *
 * - Якщо сума покупки не перевищує баланс:
 *    - Відняти з балансу суму покупки
 *    - Вивести повідомлення «На рахунку залишилося [число] кредитів»
 * - Якщо сума покупки перевищує баланс:
 *    - Вивести повідомлення «На рахунку недостатньо коштів для проведення операції!»
 * - В кінці вивести повідомлення «Операція завершена»
 */

// let balance = 10000;
// const payment = 20000;

// alert(`Загальна вартість замовлення ${payment} кредитів. Перевіряємо кількість 
//      доступних коштів на рахунку`)
// if(balance > payment){
//     balance -= payment
//     alert(`На рахунку залишилося ${balance} кредитів`);
// }
// else{
//     alert(`На рахунку недостатньо коштів для проведення операції!`);
// }
// alert(`Операція завершена`);



// 'Все добре, знімаємо гроші... Дякуємо за покупку!'










/*
 * Напиши скрит підрахунку суми покупки зі знижкою в залежності від витраченої 
 * суми за весь час (партнерська програма).
 *
 * - Загальна сума витрачених коштів зберігається в змінній totalSpent
 * - Сума поточного платежа зберігається в змінній payment
 * - Знижка зберігається в змінній discount
 *  - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
 * - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
 * - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
 * - Якщо витрачено менше 100) - не партнер, знижка 0%
 *
 * - В результаті вивести повідомлення
 * «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»
 */
// const totalSpent = 2000;
// let payment = 500;
// let discount = 0;

// if(totalSpent>=100 && totalSpent<1000){
//    discount = 0.02;
//    console.log(`Бронзовий партнер, знижка ${discount*100}%`);
// }
// else if(totalSpent>=1000 && totalSpent<=5000){
//    discount = 0.05;
//    console.log(`Срібний партнер, знижка ${discount*100}%`)
// }
// else if(totalSpent>=5000){
//     discount = 0.10;
//     console.log(`Золотий партнер, знижка ${discount*100}%`);
// }
// else{
//     console.log(`У вас ще немає партнерської знижки`);
// }
// 'Бронзовий партнер, знижка 2%'
// 'Срібний партнер, знижка 5%'
// 'Золотий партнер, знижка 10%'
// 'У вас ще немає партнерської знижки'





