// цикл for
// let i - лет тому що буде повторюватися та зміюноватися, і - змінна
// і <= 5 - скільки раз буде повторюватися ( ОБОВ'ЯЗКОВО ! )
// += це типу скільки додається. якщо += 2, то буде у консолі
// 1, 3, 5. при класиці, 1, 2, 3, 4, 5.

// for(let i = 1; i <= 5; i += 1){
//   console.log(i);
// }




/*
 * Напиши скрипт який підраховує загальну суму зп працівників.
 * Кількість робітників зберігається в змінній employees.
 * ЗП кожного працівника це випадкове число від 500 до 5000
 * Записати суму в змінну totalSalary і вивести в консоль
 */


// const employees = 4;
// const minSalary = 500;
// const maxSalary = 5000;
// let totalSalary = 0;

// замість і = 0;, можна і = 1;. це також правильно

// for(let i = 0; i <= 4; i += 1){
//     const salary = Math.round(Math.random() * (maxSalary - minSalary ) + minSalary);
//     console.log(salary);

//     totalSalary += salary
//     console.log(totalSalary);
// }


/*
 * Напиши скрипт який порахує суму всіх парних чисел,
 * які входять в діапазон чисел в змінних від min до max.
 * Наприклад, якщо min=0 и max=5, то діапазон 0-5, і в 
 * ньому 2 парних числа - 2 та 4, їх сума 6.
 */


// 1. створюємо змінні
// 2. створюємо цикл
// 3. перевірка на парність числа
// 4. додаємо парні числа

// const min = 0;
// const max = 5;
// let total = 0;

// <= - 5 входить до умови, < - не входить до умови

// for(let i = min; i <= max; i += 1){
//   if(i % 2 === 0){
//     total += i
//   }
//   console.log(total);
// }



// цикл while

// let i = 0;

// while(i <= 5) {
//     console.log(i);
//     i += 1
// }



// цикл do...while

// do{
//  console.log(5);
// } while () {

// }



// for(let count = 0; count < 5; count += 1){
//  console.log(count);
// }

